{"posts":[{"file":"13_02_2023-IntroToFlask.md","date":"13/02/2023","title":"# Intro to Flask & the MVC","content":"<h2 id=\"whatisthemvc\">What is the MVC?</h2>\n<p>The MVC model has three parts:</p>\n<ul>\n<li>Model</li>\n<li>View</li>\n<li>Controller</li>\n</ul>\n<p>But what are these three parts?</p>\n<h3 id=\"model\">Model</h3>\n<p>The model is the data that is stored by the application, such as users and items. This is the data that will be manipulated by the application and displayed to the user.</p>\n<h3 id=\"view\">View</h3>\n<p>The view is the front end of the website. This includes the HTML, CSS and JavaScript that a website holds.</p>\n<h3 id=\"controller\">Controller</h3>\n<p>The controller is the web server for the application, it's responsible for processing the user's requests and returning the appropriate data to the view.</p>\n<h2 id=\"whatisflask\">What is Flask?</h2>\n<p>Flask is one of the most popular web frameworks for Python. It's used to create both the front end and back end for a website acting as the controller in an MVC model. It handles the requests made and can be programmed to send back different response pages, such as a 404 page.</p>\n<p>It can also deal with template pages, using blocks of html that can be reused across multiple pages or slotted into existing pages.</p>\n<h2 id=\"anoverviewoftheweek\">An overview of the week</h2>\n<p>Over the week I looked into the MVC model and how it works. I also looked into Flask and how it can be used to create a web application. I looked into how to create a basic Flask application and how to use the Jinja templating engine to create template pages. I got a brief understanding of how Flask works internally, but a greater understanding of how to use flask to create a web page. This experience and knowledge will help me in future to create more complex web applications.</p>\n<p>To create a basic flask app, I started following <a href=\"https://blog.miguelgrinberg.com/post/the-flask-mega-tutorial-part-i-hello-world\">this mega tutorial</a>. At the beginning we went through the initial setup of a flask application where we created an <code>__init__</code>:</p>\n<pre><code class=\"python language-python\">from flask import Flask\nfrom config import Config\n\napp = Flask(__name__)\napp.config.from_object(Config)\n\nfrom app import routes\n</code></pre>\n<p>this references the routes file which contains the routes for the application, such as when someone goes to any specific page. This is where the controller part of the MVC comes in, as it handles the request, returning the appropriate response.</p>\n<pre><code class=\"py language-py\">from app import app\nfrom flask import render_template\nfrom app.forms import LoginForm\n\n# Set the suffixes/pages\n@app.route('/')\n@app.route('/index')\ndef index():\n    # Temp Data\n    user = {'username': 'User123'}\n    posts = [\n        {\n            'author': {'username': 'John'},\n            'body': 'Beautiful day in Portland!'\n        },\n        {\n            'author': {'username': 'Susan'},\n            'body': 'The Avengers movie was so cool!'\n        }\n    ]\n    # Generate the page, filling in a template\n    return render_template('index.html', title='Home', user=user, posts=posts)\n\n@app.route('/login')\ndef login():\n    form = LoginForm()\n    return render_template('base.html', title='Sign In', form=form)\n</code></pre>\n<p>The referenced template for the login form, 'base.html' is written in html and uses the Jinja template format to fill in the form:</p>\n<pre><code class=\"html language-html\">&lt;!doctype html&gt;\n&lt;html&gt;\n\n&lt;head&gt;\n    &lt;!-- Statements that aren't inputting variables (Which uses { var })\n        use {\\%  %} such as if statements and loops --&gt;\n    {% if title %}\n    &lt;title&gt;{{ title }} - Microblog&lt;/title&gt;\n    {% else %}\n    &lt;title&gt;Welcome to Microblog&lt;/title&gt;\n    {% endif %}\n&lt;/head&gt;\n\n&lt;body&gt;\n    &lt;div&gt;\n        Microblog: \n        &lt;a href=\"/index\"&gt;Home&lt;/a&gt;\n        &lt;a href=\"/login\"&gt;Login&lt;/a&gt;\n    &lt;/div&gt;\n    &lt;hr&gt;\n    &lt;!-- Blocks use templates to fill in information, \n        usually from another file extending this template and defining the block --&gt;\n    {% block content %}{% endblock %}\n&lt;/body&gt;\n\n&lt;/html&gt;\n</code></pre>\n<p>This is a very basic example of how flask works, but it shows how the controller part of the MVC works. It handles the request and returns the appropriate response, in this case the webpage. It's quite a simple process but can be used to create more complex web applications than just using HTML, CSS and JavaScript like I did last year.</p>\n<h2 id=\"whatnext\">What next?</h2>\n<p>In the coming weeks I will be continuing through the mega tutorial which will continue to teach me about the MVC model and how I can use Flask to create a web application which I can use for my final year project. I believe that I need to put in a bit more work for Flask outside of class to get a better understanding of how it works and how I can use it to create a better web application or website.</p>\n<h2 id=\"reflection\">Reflection</h2>\n<p>This week in Web Dev was quite interesting looking into the MVC model and Flask. I stayed on topic for most of the week with a few chats with the Year 12s and lending a hand to a few Year 11s. I think I am putting in the effort in this subject, but I noticed a little bit through the week that I was focusing more on Data Science, following last year's habit, but I pulled myself back on track and got back into the Web Dev work. Next week I will continue to work through the tutorial to get myself to a level where I can create my own projects using Flask and be able to use the knowledge for my final project.</p>","preview":"<h2 id=\"whatisthemvc\">What is the MVC?</h2>\n<p>The MVC model has three parts:</p>\n<ul>\n<li>Model</li>\n<li>View</li>\n<li>Controller</li>\n</ul>\n<p>But what are these three parts?</p>\n<h3 id=\"model\">Model</h3>\n<p>The model is the data that is stored by the application, such as users and items. This is the data that will be manipulated by the application and displayed to the user.</p>\n<h3 id=\"view\">View</h3>\n<p>The view is the front end of the website. This includes the HTML, CSS and JavaScript t","id":"IntroToFlask"}]}